/*********************************************************************************************************
**
**                                北京翼辉信息技术有限公司
**
**                                  微型安全实时操作系统
**
**                                      MS-RTOS(TM)
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: iot_pi_pro_ts.h
**
** 创   建   人: Yu.kangzhi
**
** 文件创建日期: 2020 年 04 月 07 日
**
** 描        述: IoT Pi Pro Touch Screen 驱动
**
** 参 考 文  件: stm32h750b_discovery_ts.h
*********************************************************************************************************/

#ifndef IOT_PI_PRO_TS_H
#define IOT_PI_PRO_TS_H

#ifdef __cplusplus
extern "C" {
#endif

ms_err_t gt911_drv_register(void);
ms_err_t gt911_dev_create(const char *path, const char *i2c_bus_name);

#ifdef __cplusplus
}
#endif

#endif                                                          /* IOT_PI_PRO_TS_H                      */
/*********************************************************************************************************
   END
*********************************************************************************************************/
