/*********************************************************************************************************
**
**                                北京翼辉信息技术有限公司
**
**                                  微型安全实时操作系统
**
**                                      MS-RTOS(TM)
**
**                               Copyright All Rights Reserved
**
**--------------文件信息--------------------------------------------------------------------------------
**
** 文   件   名: iot_pi_pro_uart.h
**
** 创   建   人: Yu.kangzhi
**
** 文件创建日期: 2020 年 04 月 07 日
**
** 描        述: IoT Pi Pro USART 驱动
*********************************************************************************************************/

#ifndef IOT_PI_PRO_UART_H
#define IOT_PI_PRO_UART_H

#ifdef __cplusplus
extern "C" {
#endif

ms_err_t stm32_uart_get_hw_info(ms_uint8_t channel, IRQn_Type *irq, UART_HandleTypeDef **handler);

#ifdef __cplusplus
}
#endif

#endif                                                                  /*  IOT_PI_PRO_UART_H           */
/*********************************************************************************************************
   END
*********************************************************************************************************/
